1.Installing Pandas

In [1]:
import pandas as pd

2.Making Manual Data and Data Framing

In [2]:
data = {
    "Name": ["Yash", "Kunal", "Supriya"],
    "Age": [12, 23, 32],
    "Salary": [2000, 33000, 5000],
}
df = pd.DataFrame(data)
print(df)

      Name  Age  Salary
0     Yash   12    2000
1    Kunal   23   33000
2  Supriya   32    5000

3.Reading and Printing a CSV File

In [3]:
data = pd.read_csv(
    r"C:\Users\sayud\OneDrive\Desktop\Data Science\Pandas\Datasets-main\movies.csv"
)

print(data)

     rank   movie_id                     title  year  \
0       1  tt0111161  The Shawshank Redemption  1994
1       2  tt0068646             The Godfather  1972
2       3  tt0468569           The Dark Knight  2008
3       4  tt0071562     The Godfather Part II  1974
4       5  tt0050083              12 Angry Men  1957
..    ...        ...                       ...   ...
245   246  tt0071411               Dersu Uzala  1975
246   247  tt1454029                  The Help  2011
247   248  tt0103639                   Aladdin  1992
248   249  tt0083987                    Gandhi  1982
249   250  tt0099348        Dances with Wolves  1990

                                     link imbd_votes  imbd_rating certificate  \
0    https://www.imdb.com/title/tt0111161  2,711,075          9.3           R
1    https://www.imdb.com/title/tt0068646  1,882,829          9.2           R
2    https://www.imdb.com/title/tt0468569  2,684,051          9.0       PG-13
3    https://www.imdb.com/title/tt0071562  1,285,350          9.0           R
4    https://www.imdb.com/title/tt0050083    800,954          9.0    Approved
..                                    ...        ...          ...         ...
245  https://www.imdb.com/title/tt0071411     31,167          8.2           G
246  https://www.imdb.com/title/tt1454029    466,011          8.1       PG-13
247  https://www.imdb.com/title/tt0103639    429,219          8.0           G
248  https://www.imdb.com/title/tt0083987    234,688          8.0          PG
249  https://www.imdb.com/title/tt0099348    271,823          8.0       PG-13

    duration                       genre  ...          director_id  \
0     2h 22m                       Drama  ...            nm0001104
1     2h 55m                 Crime,Drama  ...            nm0000338
2     2h 32m          Action,Crime,Drama  ...            nm0634240
3     3h 22m                 Crime,Drama  ...            nm0000338
4     1h 36m                 Crime,Drama  ...            nm0001486
..       ...                         ...  ...                  ...
245   2h 22m   Adventure,Biography,Drama  ...            nm0000041
246   2h 26m                       Drama  ...            nm0853238
247   1h 30m  Animation,Adventure,Comedy  ...  nm0166256,nm0615780
248   3h 11m     Biography,Drama,History  ...            nm0000277
249    3h 1m     Adventure,Drama,Western  ...            nm0000126

                director_name  \
0              Frank Darabont
1        Francis Ford Coppola
2           Christopher Nolan
3        Francis Ford Coppola
4                Sidney Lumet
..                        ...
245            Akira Kurosawa
246               Tate Taylor
247  Ron Clements,John Musker
248      Richard Attenborough
249             Kevin Costner

                                             writer_id  \
0                                  nm0000175,nm0001104
1                                  nm0701374,nm0000338
2    tt0468569,nm0634300,nm0634240,nm0275286,tt0468569
3                                  nm0000338,nm0701374
4                                            nm0741627
..                                                 ...
245                      nm0000041,nm0619330,nm0037539
246                                nm0853238,nm3543826
247  tt0103639,nm0166256,nm0615780,nm0254645,tt0103639
248                                          nm0109300
249                                          nm0086658

                                           writer_name  \
0                          Stephen King,Frank Darabont
1                      Mario Puzo,Francis Ford Coppola
2    Writers,Jonathan Nolan,Christopher Nolan,David...
3                      Francis Ford Coppola,Mario Puzo
4                                        Reginald Rose
..                                                 ...
245      Akira Kurosawa,Yuriy Nagibin,Vladimir Arsenev
246                       Tate Taylor,Kathryn Stockett
247      Writers,Ron Clements,John Musker,Ted Elliott,
248                                        John Briley
249                                      Michael Blake

                                             storyline  \
0    Over the course of several years, two convicts...
1    The aging patriarch of an organized crime dyna...
2    When the menace known as the Joker wreaks havo...
3    The early life and career of Vito Corleone in ...
4    The jury in a New York City murder trial is fr...
..                                                 ...
245  The Russian army sends an explorer on an exped...
246  An aspiring author during the civil rights mov...
247  A kindhearted street urchin and a power-hungry...
248  The life of the lawyer who became the famed le...
249  Lieutenant John Dunbar, assigned to a remote w...

                                               user_id  \
0    ur16161013,ur15311310,ur0265899,ur16117882,ur1...
1    ur24740649,ur86182727,ur15794099,ur15311310,ur...
2    ur87850731,ur1293485,ur129557514,ur12449122,ur...
3    ur0176092,ur0688559,ur92260614,ur0200644,ur117...
4    ur1318549,ur0643062,ur0688559,ur20552756,ur945...
..                                                 ...
245  ur0453068,ur0491610,ur3212364,ur2488512,ur1911...
246  ur0806494,ur1391596,ur24207576,ur2955724,ur221...
247  ur1293485,ur1416505,ur4445210,ur4234119,ur0909...
248  ur0954062,ur0688559,ur0176092,ur0940950,ur2620...
249  ur66111139,ur16161013,ur20597848,ur1413169,ur5...

                                             user_name  \
0    hitchcockthelegend,Sleepin_Dragon,EyeDunno,ale...
1    CalRhys,andrewburgereviews,gogoschka-1,Sleepin...
2    MrHeraclius,Smells_Like_Cheese,dseferaj,little...
3    Nazi_Fighter_David,tfrizzell,umunir-36959,DanB...
4    uds3,tedg,tfrizzell,TheLittleSongbird,henrique...
..                                                 ...
245  Quinoa1984,howard.schumann,Spondonman,claudio_...
246  ferguson-6,JohnDeSando,taylor_king-890-815491,...
247  Smells_Like_Cheese,Boba_Fett1138,ccthemovieman...
248  khatcher-2,tfrizzell,Nazi_Fighter_David,Rod-88...
249  gbill-74877,hitchcockthelegend,bheadher,Philip...

                                             review_id  \
0    rw2284594,rw6606154,rw1221355,rw1822343,rw1288...
1    rw3038370,rw4756923,rw4059579,rw6568526,rw1897...
2    rw5478826,rw1914442,rw6606026,rw1917099,rw5170...
3    rw0135607,rw0135487,rw5049900,rw0135526,rw0135...
4    rw0060044,rw0060025,rw0060034,rw2262425,rw5448...
..                                                 ...
245  rw1024676,rw0134934,rw1122059,rw2168879,rw2373...
246  rw2473566,rw2472337,rw2472299,rw2697863,rw2488...
247  rw0302749,rw0950861,rw1571053,rw2534639,rw0302...
248  rw0194126,rw1179566,rw1106866,rw0194132,rw0194...
249  rw6808367,rw2322324,rw4656461,rw0959913,rw1379...

                                          review_title  \
0    Some birds aren't meant to be caged.,An incred...
1    The Pinnacle Of Flawless Films!,An offer so go...
2    The Dark Knight,The Batman of our dreams! So m...
3    Breathtaking in its scope and tragic grandeur....
4    The over-used term "classic movie" really come...
..                                                 ...
245  a tribute to the endurance of man and nature, ...
246  Minny Don't Burn Chicken,Ready to burst . . .,...
247  I'd put it in with the Disney classics,Great s...
248  Took nearly twenty years to make - not a singl...
249  Fantastic,It is the trail of a true human bein...

                                        review_content
0    The Shawshank Redemption is written and direct...
1    'The Godfather' is the pinnacle of flawless fi...
2    Confidently directed, dark, brooding, and pack...
3    Coppola's masterpiece is rivaled only by "The ...
4    This once-in-a-generation masterpiece simply h...
..                                                 ...
245  For a variety of reasons (that are well known ...
246  Greetings again from the darkness. The film is...
247  Aladdin is such an awesome move that still get...
248  Here indeed is one of the great films of the 2...
249  It's hard to think of blockbuster films that p...

[250 rows x 22 columns]

4.Data Framing Readed CSV File

In [4]:
df = pd.DataFrame(data)
print(data)

     rank   movie_id                     title  year  \
0       1  tt0111161  The Shawshank Redemption  1994
1       2  tt0068646             The Godfather  1972
2       3  tt0468569           The Dark Knight  2008
3       4  tt0071562     The Godfather Part II  1974
4       5  tt0050083              12 Angry Men  1957
..    ...        ...                       ...   ...
245   246  tt0071411               Dersu Uzala  1975
246   247  tt1454029                  The Help  2011
247   248  tt0103639                   Aladdin  1992
248   249  tt0083987                    Gandhi  1982
249   250  tt0099348        Dances with Wolves  1990

                                     link imbd_votes  imbd_rating certificate  \
0    https://www.imdb.com/title/tt0111161  2,711,075          9.3           R
1    https://www.imdb.com/title/tt0068646  1,882,829          9.2           R
2    https://www.imdb.com/title/tt0468569  2,684,051          9.0       PG-13
3    https://www.imdb.com/title/tt0071562  1,285,350          9.0           R
4    https://www.imdb.com/title/tt0050083    800,954          9.0    Approved
..                                    ...        ...          ...         ...
245  https://www.imdb.com/title/tt0071411     31,167          8.2           G
246  https://www.imdb.com/title/tt1454029    466,011          8.1       PG-13
247  https://www.imdb.com/title/tt0103639    429,219          8.0           G
248  https://www.imdb.com/title/tt0083987    234,688          8.0          PG
249  https://www.imdb.com/title/tt0099348    271,823          8.0       PG-13

    duration                       genre  ...          director_id  \
0     2h 22m                       Drama  ...            nm0001104
1     2h 55m                 Crime,Drama  ...            nm0000338
2     2h 32m          Action,Crime,Drama  ...            nm0634240
3     3h 22m                 Crime,Drama  ...            nm0000338
4     1h 36m                 Crime,Drama  ...            nm0001486
..       ...                         ...  ...                  ...
245   2h 22m   Adventure,Biography,Drama  ...            nm0000041
246   2h 26m                       Drama  ...            nm0853238
247   1h 30m  Animation,Adventure,Comedy  ...  nm0166256,nm0615780
248   3h 11m     Biography,Drama,History  ...            nm0000277
249    3h 1m     Adventure,Drama,Western  ...            nm0000126

                director_name  \
0              Frank Darabont
1        Francis Ford Coppola
2           Christopher Nolan
3        Francis Ford Coppola
4                Sidney Lumet
..                        ...
245            Akira Kurosawa
246               Tate Taylor
247  Ron Clements,John Musker
248      Richard Attenborough
249             Kevin Costner

                                             writer_id  \
0                                  nm0000175,nm0001104
1                                  nm0701374,nm0000338
2    tt0468569,nm0634300,nm0634240,nm0275286,tt0468569
3                                  nm0000338,nm0701374
4                                            nm0741627
..                                                 ...
245                      nm0000041,nm0619330,nm0037539
246                                nm0853238,nm3543826
247  tt0103639,nm0166256,nm0615780,nm0254645,tt0103639
248                                          nm0109300
249                                          nm0086658

                                           writer_name  \
0                          Stephen King,Frank Darabont
1                      Mario Puzo,Francis Ford Coppola
2    Writers,Jonathan Nolan,Christopher Nolan,David...
3                      Francis Ford Coppola,Mario Puzo
4                                        Reginald Rose
..                                                 ...
245      Akira Kurosawa,Yuriy Nagibin,Vladimir Arsenev
246                       Tate Taylor,Kathryn Stockett
247      Writers,Ron Clements,John Musker,Ted Elliott,
248                                        John Briley
249                                      Michael Blake

                                             storyline  \
0    Over the course of several years, two convicts...
1    The aging patriarch of an organized crime dyna...
2    When the menace known as the Joker wreaks havo...
3    The early life and career of Vito Corleone in ...
4    The jury in a New York City murder trial is fr...
..                                                 ...
245  The Russian army sends an explorer on an exped...
246  An aspiring author during the civil rights mov...
247  A kindhearted street urchin and a power-hungry...
248  The life of the lawyer who became the famed le...
249  Lieutenant John Dunbar, assigned to a remote w...

                                               user_id  \
0    ur16161013,ur15311310,ur0265899,ur16117882,ur1...
1    ur24740649,ur86182727,ur15794099,ur15311310,ur...
2    ur87850731,ur1293485,ur129557514,ur12449122,ur...
3    ur0176092,ur0688559,ur92260614,ur0200644,ur117...
4    ur1318549,ur0643062,ur0688559,ur20552756,ur945...
..                                                 ...
245  ur0453068,ur0491610,ur3212364,ur2488512,ur1911...
246  ur0806494,ur1391596,ur24207576,ur2955724,ur221...
247  ur1293485,ur1416505,ur4445210,ur4234119,ur0909...
248  ur0954062,ur0688559,ur0176092,ur0940950,ur2620...
249  ur66111139,ur16161013,ur20597848,ur1413169,ur5...

                                             user_name  \
0    hitchcockthelegend,Sleepin_Dragon,EyeDunno,ale...
1    CalRhys,andrewburgereviews,gogoschka-1,Sleepin...
2    MrHeraclius,Smells_Like_Cheese,dseferaj,little...
3    Nazi_Fighter_David,tfrizzell,umunir-36959,DanB...
4    uds3,tedg,tfrizzell,TheLittleSongbird,henrique...
..                                                 ...
245  Quinoa1984,howard.schumann,Spondonman,claudio_...
246  ferguson-6,JohnDeSando,taylor_king-890-815491,...
247  Smells_Like_Cheese,Boba_Fett1138,ccthemovieman...
248  khatcher-2,tfrizzell,Nazi_Fighter_David,Rod-88...
249  gbill-74877,hitchcockthelegend,bheadher,Philip...

                                             review_id  \
0    rw2284594,rw6606154,rw1221355,rw1822343,rw1288...
1    rw3038370,rw4756923,rw4059579,rw6568526,rw1897...
2    rw5478826,rw1914442,rw6606026,rw1917099,rw5170...
3    rw0135607,rw0135487,rw5049900,rw0135526,rw0135...
4    rw0060044,rw0060025,rw0060034,rw2262425,rw5448...
..                                                 ...
245  rw1024676,rw0134934,rw1122059,rw2168879,rw2373...
246  rw2473566,rw2472337,rw2472299,rw2697863,rw2488...
247  rw0302749,rw0950861,rw1571053,rw2534639,rw0302...
248  rw0194126,rw1179566,rw1106866,rw0194132,rw0194...
249  rw6808367,rw2322324,rw4656461,rw0959913,rw1379...

                                          review_title  \
0    Some birds aren't meant to be caged.,An incred...
1    The Pinnacle Of Flawless Films!,An offer so go...
2    The Dark Knight,The Batman of our dreams! So m...
3    Breathtaking in its scope and tragic grandeur....
4    The over-used term "classic movie" really come...
..                                                 ...
245  a tribute to the endurance of man and nature, ...
246  Minny Don't Burn Chicken,Ready to burst . . .,...
247  I'd put it in with the Disney classics,Great s...
248  Took nearly twenty years to make - not a singl...
249  Fantastic,It is the trail of a true human bein...

                                        review_content
0    The Shawshank Redemption is written and direct...
1    'The Godfather' is the pinnacle of flawless fi...
2    Confidently directed, dark, brooding, and pack...
3    Coppola's masterpiece is rivaled only by "The ...
4    This once-in-a-generation masterpiece simply h...
..                                                 ...
245  For a variety of reasons (that are well known ...
246  Greetings again from the darkness. The film is...
247  Aladdin is such an awesome move that still get...
248  Here indeed is one of the great films of the 2...
249  It's hard to think of blockbuster films that p...

[250 rows x 22 columns]

5.For Reading xlsx(Excel File)
Firstly we need to download openpyxl

In [5]:
pip install openpyxl

Requirement already satisfied: openpyxl in c:\users\sayud\anaconda3\lib\site-packages (3.1.2)
Requirement already satisfied: et-xmlfile in c:\users\sayud\anaconda3\lib\site-packages (from openpyxl) (1.1.0)
Note: you may need to restart the kernel to use updated packages.

In [6]:
data = pd.read_excel(
    r"C:\Users\sayud\OneDrive\Desktop\Data Science\Pandas\Datasets-main\ESD.xlsx"
)

print(data)

df = pd.DataFrame(data)

print(df)

       EEID        Full Name                 Job Title  Department  \
0    E02387      Emily Davis                Sr. Manger          IT
1    E04105    Theodore Dinh       Technical Architect          IT
2    E02572     Luna Sanders                  Director     Finance
3    E02832  Penelope Jordan  Computer Systems Manager          IT
4    E01639        Austin Vo               Sr. Analyst     Finance
..      ...              ...                       ...         ...
995  E03094     Wesley Young               Sr. Analyst   Marketing
996  E01909     Lillian Khan                   Analyst     Finance
997  E04398      Oliver Yang                  Director   Marketing
998  E02521      Lily Nguyen               Sr. Analyst     Finance
999  E03545      Sofia Cheng            Vice President  Accounting

              Business Unit  Gender  Ethnicity  Age  Hire Date  Annual Salary  \
0    Research & Development  Female      Black   55 2016-04-08         141604
1             Manufacturing    Male      Asian   59 1997-11-29          99975
2       Speciality Products  Female  Caucasian   50 2006-10-26         163099
3             Manufacturing  Female  Caucasian   26 2019-09-27          84913
4             Manufacturing    Male      Asian   55 1995-11-20          95409
..                      ...     ...        ...  ...        ...            ...
995     Speciality Products    Male  Caucasian   33 2016-09-18          98427
996     Speciality Products  Female      Asian   44 2010-05-31          47387
997     Speciality Products    Male      Asian   31 2019-06-10         176710
998     Speciality Products  Female      Asian   33 2012-01-28          95960
999               Corporate  Female      Asian   63 2020-07-26         216195

     Bonus %        Country       City  Exit Date
0       0.15  United States    Seattle 2021-10-16
1       0.00          China  Chongqing        NaT
2       0.20  United States    Chicago        NaT
3       0.07  United States    Chicago        NaT
4       0.00  United States    Phoenix        NaT
..       ...            ...        ...        ...
995     0.00  United States   Columbus        NaT
996     0.00          China    Chengdu 2018-01-08
997     0.15  United States      Miami        NaT
998     0.00          China    Chengdu        NaT
999     0.31  United States      Miami        NaT

[1000 rows x 14 columns]
       EEID        Full Name                 Job Title  Department  \
0    E02387      Emily Davis                Sr. Manger          IT
1    E04105    Theodore Dinh       Technical Architect          IT
2    E02572     Luna Sanders                  Director     Finance
3    E02832  Penelope Jordan  Computer Systems Manager          IT
4    E01639        Austin Vo               Sr. Analyst     Finance
..      ...              ...                       ...         ...
995  E03094     Wesley Young               Sr. Analyst   Marketing
996  E01909     Lillian Khan                   Analyst     Finance
997  E04398      Oliver Yang                  Director   Marketing
998  E02521      Lily Nguyen               Sr. Analyst     Finance
999  E03545      Sofia Cheng            Vice President  Accounting

              Business Unit  Gender  Ethnicity  Age  Hire Date  Annual Salary  \
0    Research & Development  Female      Black   55 2016-04-08         141604
1             Manufacturing    Male      Asian   59 1997-11-29          99975
2       Speciality Products  Female  Caucasian   50 2006-10-26         163099
3             Manufacturing  Female  Caucasian   26 2019-09-27          84913
4             Manufacturing    Male      Asian   55 1995-11-20          95409
..                      ...     ...        ...  ...        ...            ...
995     Speciality Products    Male  Caucasian   33 2016-09-18          98427
996     Speciality Products  Female      Asian   44 2010-05-31          47387
997     Speciality Products    Male      Asian   31 2019-06-10         176710
998     Speciality Products  Female      Asian   33 2012-01-28          95960
999               Corporate  Female      Asian   63 2020-07-26         216195

     Bonus %        Country       City  Exit Date
0       0.15  United States    Seattle 2021-10-16
1       0.00          China  Chongqing        NaT
2       0.20  United States    Chicago        NaT
3       0.07  United States    Chicago        NaT
4       0.00  United States    Phoenix        NaT
..       ...            ...        ...        ...
995     0.00  United States   Columbus        NaT
996     0.00          China    Chengdu 2018-01-08
997     0.15  United States      Miami        NaT
998     0.00          China    Chengdu        NaT
999     0.31  United States      Miami        NaT

[1000 rows x 14 columns]

6.Exploring the big data

In [7]:
data = pd.read_excel(
    r"C:\Users\sayud\OneDrive\Desktop\Data Science\Pandas\Datasets-main\ESD.xlsx"
)

print(data)

       EEID        Full Name                 Job Title  Department  \
0    E02387      Emily Davis                Sr. Manger          IT
1    E04105    Theodore Dinh       Technical Architect          IT
2    E02572     Luna Sanders                  Director     Finance
3    E02832  Penelope Jordan  Computer Systems Manager          IT
4    E01639        Austin Vo               Sr. Analyst     Finance
..      ...              ...                       ...         ...
995  E03094     Wesley Young               Sr. Analyst   Marketing
996  E01909     Lillian Khan                   Analyst     Finance
997  E04398      Oliver Yang                  Director   Marketing
998  E02521      Lily Nguyen               Sr. Analyst     Finance
999  E03545      Sofia Cheng            Vice President  Accounting

              Business Unit  Gender  Ethnicity  Age  Hire Date  Annual Salary  \
0    Research & Development  Female      Black   55 2016-04-08         141604
1             Manufacturing    Male      Asian   59 1997-11-29          99975
2       Speciality Products  Female  Caucasian   50 2006-10-26         163099
3             Manufacturing  Female  Caucasian   26 2019-09-27          84913
4             Manufacturing    Male      Asian   55 1995-11-20          95409
..                      ...     ...        ...  ...        ...            ...
995     Speciality Products    Male  Caucasian   33 2016-09-18          98427
996     Speciality Products  Female      Asian   44 2010-05-31          47387
997     Speciality Products    Male      Asian   31 2019-06-10         176710
998     Speciality Products  Female      Asian   33 2012-01-28          95960
999               Corporate  Female      Asian   63 2020-07-26         216195

     Bonus %        Country       City  Exit Date
0       0.15  United States    Seattle 2021-10-16
1       0.00          China  Chongqing        NaT
2       0.20  United States    Chicago        NaT
3       0.07  United States    Chicago        NaT
4       0.00  United States    Phoenix        NaT
..       ...            ...        ...        ...
995     0.00  United States   Columbus        NaT
996     0.00          China    Chengdu 2018-01-08
997     0.15  United States      Miami        NaT
998     0.00          China    Chengdu        NaT
999     0.31  United States      Miami        NaT

[1000 rows x 14 columns]

7.For exploring starting or ending specific(n) of big data

In [8]:
print(data.head(10))  # for first 10
print(data.tail(10))  # For ending 10

     EEID        Full Name                 Job Title  Department  \
0  E02387      Emily Davis                Sr. Manger          IT
1  E04105    Theodore Dinh       Technical Architect          IT
2  E02572     Luna Sanders                  Director     Finance
3  E02832  Penelope Jordan  Computer Systems Manager          IT
4  E01639        Austin Vo               Sr. Analyst     Finance
5  E00644     Joshua Gupta    Account Representative       Sales
6  E01550      Ruby Barnes                   Manager          IT
7  E04332      Luke Martin                   Analyst     Finance
8  E04533    Easton Bailey                   Manager  Accounting
9  E03838  Madeline Walker               Sr. Analyst     Finance

            Business Unit  Gender  Ethnicity  Age  Hire Date  Annual Salary  \
0  Research & Development  Female      Black   55 2016-04-08         141604
1           Manufacturing    Male      Asian   59 1997-11-29          99975
2     Speciality Products  Female  Caucasian   50 2006-10-26         163099
3           Manufacturing  Female  Caucasian   26 2019-09-27          84913
4           Manufacturing    Male      Asian   55 1995-11-20          95409
5               Corporate    Male      Asian   57 2017-01-24          50994
6               Corporate  Female  Caucasian   27 2020-07-01         119746
7           Manufacturing    Male      Black   25 2020-05-16          41336
8           Manufacturing    Male  Caucasian   29 2019-01-25         113527
9     Speciality Products  Female  Caucasian   34 2018-06-13          77203

   Bonus %        Country       City  Exit Date
0     0.15  United States    Seattle 2021-10-16
1     0.00          China  Chongqing        NaT
2     0.20  United States    Chicago        NaT
3     0.07  United States    Chicago        NaT
4     0.00  United States    Phoenix        NaT
5     0.00          China  Chongqing        NaT
6     0.10  United States    Phoenix        NaT
7     0.00  United States      Miami 2021-05-20
8     0.06  United States     Austin        NaT
9     0.00  United States    Chicago        NaT
       EEID          Full Name             Job Title       Department  \
990  E01578       Anthony Hong            Sr. Manger               IT
991  E03430        Leo Herrera  Sr. Business Partner  Human Resources
992  E03058      Robert Wright   Technical Architect               IT
993  E04762  Audrey Richardson              Director               IT
994  E01148     Scarlett Kumar       Systems Analyst               IT
995  E03094       Wesley Young           Sr. Analyst        Marketing
996  E01909       Lillian Khan               Analyst          Finance
997  E04398        Oliver Yang              Director        Marketing
998  E02521        Lily Nguyen           Sr. Analyst          Finance
999  E03545        Sofia Cheng        Vice President       Accounting

              Business Unit  Gender  Ethnicity  Age  Hire Date  Annual Salary  \
990  Research & Development    Male      Asian   37 2010-11-29         146961
991  Research & Development    Male     Latino   48 1998-04-22          85369
992           Manufacturing    Male  Caucasian   30 2015-06-14          67489
993           Manufacturing  Female  Caucasian   46 2018-10-06         166259
994               Corporate  Female      Asian   55 2009-01-07          47032
995     Speciality Products    Male  Caucasian   33 2016-09-18          98427
996     Speciality Products  Female      Asian   44 2010-05-31          47387
997     Speciality Products    Male      Asian   31 2019-06-10         176710
998     Speciality Products  Female      Asian   33 2012-01-28          95960
999               Corporate  Female      Asian   63 2020-07-26         216195

     Bonus %        Country      City  Exit Date
990     0.11  United States  Columbus        NaT
991     0.00         Brazil    Manaus 2004-11-27
992     0.00  United States   Chicago        NaT
993     0.17  United States   Chicago        NaT
994     0.00  United States  Columbus        NaT
995     0.00  United States  Columbus        NaT
996     0.00          China   Chengdu 2018-01-08
997     0.15  United States     Miami        NaT
998     0.00          China   Chengdu        NaT
999     0.31  United States     Miami        NaT

8.To get overall information of data

In [9]:
print(data.info)

<bound method DataFrame.info of        EEID        Full Name                 Job Title  Department  \
0    E02387      Emily Davis                Sr. Manger          IT
1    E04105    Theodore Dinh       Technical Architect          IT
2    E02572     Luna Sanders                  Director     Finance
3    E02832  Penelope Jordan  Computer Systems Manager          IT
4    E01639        Austin Vo               Sr. Analyst     Finance
..      ...              ...                       ...         ...
995  E03094     Wesley Young               Sr. Analyst   Marketing
996  E01909     Lillian Khan                   Analyst     Finance
997  E04398      Oliver Yang                  Director   Marketing
998  E02521      Lily Nguyen               Sr. Analyst     Finance
999  E03545      Sofia Cheng            Vice President  Accounting

              Business Unit  Gender  Ethnicity  Age  Hire Date  Annual Salary  \
0    Research & Development  Female      Black   55 2016-04-08         141604
1             Manufacturing    Male      Asian   59 1997-11-29          99975
2       Speciality Products  Female  Caucasian   50 2006-10-26         163099
3             Manufacturing  Female  Caucasian   26 2019-09-27          84913
4             Manufacturing    Male      Asian   55 1995-11-20          95409
..                      ...     ...        ...  ...        ...            ...
995     Speciality Products    Male  Caucasian   33 2016-09-18          98427
996     Speciality Products  Female      Asian   44 2010-05-31          47387
997     Speciality Products    Male      Asian   31 2019-06-10         176710
998     Speciality Products  Female      Asian   33 2012-01-28          95960
999               Corporate  Female      Asian   63 2020-07-26         216195

     Bonus %        Country       City  Exit Date
0       0.15  United States    Seattle 2021-10-16
1       0.00          China  Chongqing        NaT
2       0.20  United States    Chicago        NaT
3       0.07  United States    Chicago        NaT
4       0.00  United States    Phoenix        NaT
..       ...            ...        ...        ...
995     0.00  United States   Columbus        NaT
996     0.00          China    Chengdu 2018-01-08
997     0.15  United States      Miami        NaT
998     0.00          China    Chengdu        NaT
999     0.31  United States      Miami        NaT

[1000 rows x 14 columns]>

9.To get detail infromation about data including all the columns and their data type

In [10]:
print(data.info())

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 14 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   EEID           1000 non-null   object
 1   Full Name      1000 non-null   object
 2   Job Title      1000 non-null   object
 3   Department     1000 non-null   object
 4   Business Unit  1000 non-null   object
 5   Gender         1000 non-null   object
 6   Ethnicity      1000 non-null   object
 7   Age            1000 non-null   int64
 8   Hire Date      1000 non-null   datetime64[ns]
 9   Annual Salary  1000 non-null   int64
 10  Bonus %        1000 non-null   float64
 11  Country        1000 non-null   object
 12  City           1000 non-null   object
 13  Exit Date      85 non-null     datetime64[ns]
dtypes: datetime64[ns](2), float64(1), int64(2), object(9)
memory usage: 109.5+ KB
None

10.To get satistical information of data(Only of columns of data type excluidng objects)

In [11]:
data.describe()

,Age,Hire Date,Annual Salary,Bonus %,Exit Date
count,1000.000000,1000,1000.000000,1000.000000,85
mean,44.382000,2012-04-07 02:54:14.400000,113217.365000,0.088660,2016-11-02 18:04:14.117647104
min,25.000000,1992-01-09 00:00:00,40063.000000,0.000000,1994-12-18 00:00:00
25%,35.000000,2007-02-14 00:00:00,71430.250000,0.000000,2014-12-25 00:00:00
50%,45.000000,2014-02-15 12:00:00,96557.000000,0.000000,2019-05-23 00:00:00
75%,54.000000,2018-06-22 00:00:00,150782.250000,0.150000,2021-04-09 00:00:00
max,65.000000,2021-12-26 00:00:00,258498.000000,0.400000,2022-08-17 00:00:00
std,11.246981,NaN,53545.985644,0.117856,NaN

11.Finding null values in data

In [12]:
print(data.isnull())

      EEID  Full Name  Job Title  Department  Business Unit  Gender  \
0    False      False      False       False          False   False
1    False      False      False       False          False   False
2    False      False      False       False          False   False
3    False      False      False       False          False   False
4    False      False      False       False          False   False
..     ...        ...        ...         ...            ...     ...
995  False      False      False       False          False   False
996  False      False      False       False          False   False
997  False      False      False       False          False   False
998  False      False      False       False          False   False
999  False      False      False       False          False   False

     Ethnicity    Age  Hire Date  Annual Salary  Bonus %  Country   City  \
0        False  False      False          False    False    False  False
1        False  False      False          False    False    False  False
2        False  False      False          False    False    False  False
3        False  False      False          False    False    False  False
4        False  False      False          False    False    False  False
..         ...    ...        ...            ...      ...      ...    ...
995      False  False      False          False    False    False  False
996      False  False      False          False    False    False  False
997      False  False      False          False    False    False  False
998      False  False      False          False    False    False  False
999      False  False      False          False    False    False  False

     Exit Date
0        False
1         True
2         True
3         True
4         True
..         ...
995       True
996      False
997       True
998       True
999       True

[1000 rows x 14 columns]

12.Finding null values in data column wise

In [13]:
print(data.isnull().sum())

EEID               0
Full Name          0
Job Title          0
Department         0
Business Unit      0
Gender             0
Ethnicity          0
Age                0
Hire Date          0
Annual Salary      0
Bonus %            0
Country            0
City               0
Exit Date        915
dtype: int64

13.Handling Duplicates Values

In [14]:
print(data.duplicated())  # Checks row wise in the data

0      False
1      False
2      False
3      False
4      False
       ...
995    False
996    False
997    False
998    False
999    False
Length: 1000, dtype: bool

In [15]:
print(data.duplicated("EEID"))  # For particular column

0      False
1      False
2      False
3      False
4      False
       ...
995    False
996    False
997    False
998    False
999    False
Length: 1000, dtype: bool

In [16]:
print(
    data.duplicated("EEID").sum()
)  # FInding sum of total number of duplicated in column

89

In [17]:
print(data.drop_duplicates("EEID"))

       EEID        Full Name                 Job Title  Department  \
0    E02387      Emily Davis                Sr. Manger          IT
1    E04105    Theodore Dinh       Technical Architect          IT
2    E02572     Luna Sanders                  Director     Finance
3    E02832  Penelope Jordan  Computer Systems Manager          IT
4    E01639        Austin Vo               Sr. Analyst     Finance
..      ...              ...                       ...         ...
995  E03094     Wesley Young               Sr. Analyst   Marketing
996  E01909     Lillian Khan                   Analyst     Finance
997  E04398      Oliver Yang                  Director   Marketing
998  E02521      Lily Nguyen               Sr. Analyst     Finance
999  E03545      Sofia Cheng            Vice President  Accounting

              Business Unit  Gender  Ethnicity  Age  Hire Date  Annual Salary  \
0    Research & Development  Female      Black   55 2016-04-08         141604
1             Manufacturing    Male      Asian   59 1997-11-29          99975
2       Speciality Products  Female  Caucasian   50 2006-10-26         163099
3             Manufacturing  Female  Caucasian   26 2019-09-27          84913
4             Manufacturing    Male      Asian   55 1995-11-20          95409
..                      ...     ...        ...  ...        ...            ...
995     Speciality Products    Male  Caucasian   33 2016-09-18          98427
996     Speciality Products  Female      Asian   44 2010-05-31          47387
997     Speciality Products    Male      Asian   31 2019-06-10         176710
998     Speciality Products  Female      Asian   33 2012-01-28          95960
999               Corporate  Female      Asian   63 2020-07-26         216195

     Bonus %        Country       City  Exit Date
0       0.15  United States    Seattle 2021-10-16
1       0.00          China  Chongqing        NaT
2       0.20  United States    Chicago        NaT
3       0.07  United States    Chicago        NaT
4       0.00  United States    Phoenix        NaT
..       ...            ...        ...        ...
995     0.00  United States   Columbus        NaT
996     0.00          China    Chengdu 2018-01-08
997     0.15  United States      Miami        NaT
998     0.00          China    Chengdu        NaT
999     0.31  United States      Miami        NaT

[911 rows x 14 columns]

In [18]:
data_drop = data.drop_duplicates("EEID")
print(data_drop)

       EEID        Full Name                 Job Title  Department  \
0    E02387      Emily Davis                Sr. Manger          IT
1    E04105    Theodore Dinh       Technical Architect          IT
2    E02572     Luna Sanders                  Director     Finance
3    E02832  Penelope Jordan  Computer Systems Manager          IT
4    E01639        Austin Vo               Sr. Analyst     Finance
..      ...              ...                       ...         ...
995  E03094     Wesley Young               Sr. Analyst   Marketing
996  E01909     Lillian Khan                   Analyst     Finance
997  E04398      Oliver Yang                  Director   Marketing
998  E02521      Lily Nguyen               Sr. Analyst     Finance
999  E03545      Sofia Cheng            Vice President  Accounting

              Business Unit  Gender  Ethnicity  Age  Hire Date  Annual Salary  \
0    Research & Development  Female      Black   55 2016-04-08         141604
1             Manufacturing    Male      Asian   59 1997-11-29          99975
2       Speciality Products  Female  Caucasian   50 2006-10-26         163099
3             Manufacturing  Female  Caucasian   26 2019-09-27          84913
4             Manufacturing    Male      Asian   55 1995-11-20          95409
..                      ...     ...        ...  ...        ...            ...
995     Speciality Products    Male  Caucasian   33 2016-09-18          98427
996     Speciality Products  Female      Asian   44 2010-05-31          47387
997     Speciality Products    Male      Asian   31 2019-06-10         176710
998     Speciality Products  Female      Asian   33 2012-01-28          95960
999               Corporate  Female      Asian   63 2020-07-26         216195

     Bonus %        Country       City  Exit Date
0       0.15  United States    Seattle 2021-10-16
1       0.00          China  Chongqing        NaT
2       0.20  United States    Chicago        NaT
3       0.07  United States    Chicago        NaT
4       0.00  United States    Phoenix        NaT
..       ...            ...        ...        ...
995     0.00  United States   Columbus        NaT
996     0.00          China    Chengdu 2018-01-08
997     0.15  United States      Miami        NaT
998     0.00          China    Chengdu        NaT
999     0.31  United States      Miami        NaT

[911 rows x 14 columns]

In [19]:
print(
    data_drop["EEID"].duplicated().sum()
)  # To find out is there any duplicate value left

0

13.Handling Null Values

In [20]:
data = pd.read_csv(
    r"C:\Users\sayud\OneDrive\Desktop\Data Science\Pandas\Datasets-main\company1.csv"
)

In [21]:
print(data.isnull())  # Finding null values by each column

    EEID   Name  gender  salary
0  False  False   False    True
1  False  False   False   False
2  False  False    True   False
3  False  False   False   False
4  False   True   False   False
5  False  False   False    True
6  False  False   False   False

In [22]:
print(data.isnull().sum())  # Sum of null values in any column

EEID      0
Name      1
gender    1
salary    2
dtype: int64

13.1 Replacing the Null values

In [23]:
import numpy as np


print(data.replace(np.nan, "NULL"))

    EEID      Name gender   salary
0  EMP01    ayushi      F     NULL
1  EMP02     rohit      M  25000.0
2  EMP03  pranjali   NULL  27000.0
3  EMP01    ayushi      F  20000.0
4  EMP05      NULL      M  25000.0
5  EMP06     rohit      M     NULL
6  EMP02     rohit      M  25000.0

In [24]:
print(data["salary"].mean())  # Finding mean of salary column

24400.0

In [25]:
data["salary"] = data["salary"].replace(
    np.nan, 24400
)  # Replacing NUll values of salary column with mean

print(data)

    EEID      Name gender   salary
0  EMP01    ayushi      F  24400.0
1  EMP02     rohit      M  25000.0
2  EMP03  pranjali    NaN  27000.0
3  EMP01    ayushi      F  20000.0
4  EMP05       NaN      M  25000.0
5  EMP06     rohit      M  24400.0
6  EMP02     rohit      M  25000.0

In [26]:
print(
    data.fillna(method="bfill")
)  # For backward fill: Fills NULL values with the next non-NULL value in the column (moving downward).

    EEID      Name gender   salary
0  EMP01    ayushi      F  24400.0
1  EMP02     rohit      M  25000.0
2  EMP03  pranjali      F  27000.0
3  EMP01    ayushi      F  20000.0
4  EMP05     rohit      M  25000.0
5  EMP06     rohit      M  24400.0
6  EMP02     rohit      M  25000.0

C:\Users\sayud\AppData\Local\Temp\ipykernel_22168\1866193408.py:2: FutureWarning: DataFrame.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  data.fillna(method="bfill")

In [27]:
print(
    data.fillna(method="ffill")
)  # For forward fill: Fills NULL values with the previous non-NULL value in the column (moving forward).

    EEID      Name gender   salary
0  EMP01    ayushi      F  24400.0
1  EMP02     rohit      M  25000.0
2  EMP03  pranjali      M  27000.0
3  EMP01    ayushi      F  20000.0
4  EMP05    ayushi      M  25000.0
5  EMP06     rohit      M  24400.0
6  EMP02     rohit      M  25000.0

C:\Users\sayud\AppData\Local\Temp\ipykernel_22168\913193162.py:2: FutureWarning: DataFrame.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  data.fillna(method="ffill")

14.Column Transformation

In [28]:
data = pd.read_excel(
    r"C:\Users\sayud\OneDrive\Desktop\Data Science\Pandas\Datasets-main\ESD.xlsx"
)

print(data)

       EEID        Full Name                 Job Title  Department  \
0    E02387      Emily Davis                Sr. Manger          IT
1    E04105    Theodore Dinh       Technical Architect          IT
2    E02572     Luna Sanders                  Director     Finance
3    E02832  Penelope Jordan  Computer Systems Manager          IT
4    E01639        Austin Vo               Sr. Analyst     Finance
..      ...              ...                       ...         ...
995  E03094     Wesley Young               Sr. Analyst   Marketing
996  E01909     Lillian Khan                   Analyst     Finance
997  E04398      Oliver Yang                  Director   Marketing
998  E02521      Lily Nguyen               Sr. Analyst     Finance
999  E03545      Sofia Cheng            Vice President  Accounting

              Business Unit  Gender  Ethnicity  Age  Hire Date  Annual Salary  \
0    Research & Development  Female      Black   55 2016-04-08         141604
1             Manufacturing    Male      Asian   59 1997-11-29          99975
2       Speciality Products  Female  Caucasian   50 2006-10-26         163099
3             Manufacturing  Female  Caucasian   26 2019-09-27          84913
4             Manufacturing    Male      Asian   55 1995-11-20          95409
..                      ...     ...        ...  ...        ...            ...
995     Speciality Products    Male  Caucasian   33 2016-09-18          98427
996     Speciality Products  Female      Asian   44 2010-05-31          47387
997     Speciality Products    Male      Asian   31 2019-06-10         176710
998     Speciality Products  Female      Asian   33 2012-01-28          95960
999               Corporate  Female      Asian   63 2020-07-26         216195

     Bonus %        Country       City  Exit Date
0       0.15  United States    Seattle 2021-10-16
1       0.00          China  Chongqing        NaT
2       0.20  United States    Chicago        NaT
3       0.07  United States    Chicago        NaT
4       0.00  United States    Phoenix        NaT
..       ...            ...        ...        ...
995     0.00  United States   Columbus        NaT
996     0.00          China    Chengdu 2018-01-08
997     0.15  United States      Miami        NaT
998     0.00          China    Chengdu        NaT
999     0.31  United States      Miami        NaT

[1000 rows x 14 columns]

In [29]:
# Convert the `data` dictionary (or data source) into a Pandas DataFrame
df = pd.DataFrame(data)

# Set the value of the new column 'Get Bonus' to 'No Bonus' where the 'Bonus %' column equals 0
df.loc[(df["Bonus %"] == 0), "Get Bonus"] = "No Bonus"

# Set the value of another new column 'Gets Bonus' to 'Bonus' where the 'Bonus %' column is greater than 0
df.loc[(df["Bonus %"] > 0), "Get Bonus"] = "Bonus"
print(df.head(10))

     EEID        Full Name                 Job Title  Department  \
0  E02387      Emily Davis                Sr. Manger          IT
1  E04105    Theodore Dinh       Technical Architect          IT
2  E02572     Luna Sanders                  Director     Finance
3  E02832  Penelope Jordan  Computer Systems Manager          IT
4  E01639        Austin Vo               Sr. Analyst     Finance
5  E00644     Joshua Gupta    Account Representative       Sales
6  E01550      Ruby Barnes                   Manager          IT
7  E04332      Luke Martin                   Analyst     Finance
8  E04533    Easton Bailey                   Manager  Accounting
9  E03838  Madeline Walker               Sr. Analyst     Finance

            Business Unit  Gender  Ethnicity  Age  Hire Date  Annual Salary  \
0  Research & Development  Female      Black   55 2016-04-08         141604
1           Manufacturing    Male      Asian   59 1997-11-29          99975
2     Speciality Products  Female  Caucasian   50 2006-10-26         163099
3           Manufacturing  Female  Caucasian   26 2019-09-27          84913
4           Manufacturing    Male      Asian   55 1995-11-20          95409
5               Corporate    Male      Asian   57 2017-01-24          50994
6               Corporate  Female  Caucasian   27 2020-07-01         119746
7           Manufacturing    Male      Black   25 2020-05-16          41336
8           Manufacturing    Male  Caucasian   29 2019-01-25         113527
9     Speciality Products  Female  Caucasian   34 2018-06-13          77203

   Bonus %        Country       City  Exit Date Get Bonus
0     0.15  United States    Seattle 2021-10-16     Bonus
1     0.00          China  Chongqing        NaT  No Bonus
2     0.20  United States    Chicago        NaT     Bonus
3     0.07  United States    Chicago        NaT     Bonus
4     0.00  United States    Phoenix        NaT  No Bonus
5     0.00          China  Chongqing        NaT  No Bonus
6     0.10  United States    Phoenix        NaT     Bonus
7     0.00  United States      Miami 2021-05-20  No Bonus
8     0.06  United States     Austin        NaT     Bonus
9     0.00  United States    Chicago        NaT  No Bonus

In [30]:
print(df["Get Bonus"].value_counts())  # Counts number of Bonus and No bonus

Get Bonus
No Bonus    525
Bonus       475
Name: count, dtype: int64

In [31]:
# Create a new column 'First name' by extracting the first word from 'Full Name'
data["First name"] = data["Full Name"].str.split().str[0]

# Print the DataFrame
print(data.head(10))

     EEID        Full Name                 Job Title  Department  \
0  E02387      Emily Davis                Sr. Manger          IT
1  E04105    Theodore Dinh       Technical Architect          IT
2  E02572     Luna Sanders                  Director     Finance
3  E02832  Penelope Jordan  Computer Systems Manager          IT
4  E01639        Austin Vo               Sr. Analyst     Finance
5  E00644     Joshua Gupta    Account Representative       Sales
6  E01550      Ruby Barnes                   Manager          IT
7  E04332      Luke Martin                   Analyst     Finance
8  E04533    Easton Bailey                   Manager  Accounting
9  E03838  Madeline Walker               Sr. Analyst     Finance

            Business Unit  Gender  Ethnicity  Age  Hire Date  Annual Salary  \
0  Research & Development  Female      Black   55 2016-04-08         141604
1           Manufacturing    Male      Asian   59 1997-11-29          99975
2     Speciality Products  Female  Caucasian   50 2006-10-26         163099
3           Manufacturing  Female  Caucasian   26 2019-09-27          84913
4           Manufacturing    Male      Asian   55 1995-11-20          95409
5               Corporate    Male      Asian   57 2017-01-24          50994
6               Corporate  Female  Caucasian   27 2020-07-01         119746
7           Manufacturing    Male      Black   25 2020-05-16          41336
8           Manufacturing    Male  Caucasian   29 2019-01-25         113527
9     Speciality Products  Female  Caucasian   34 2018-06-13          77203

   Bonus %        Country       City  Exit Date First name
0     0.15  United States    Seattle 2021-10-16      Emily
1     0.00          China  Chongqing        NaT   Theodore
2     0.20  United States    Chicago        NaT       Luna
3     0.07  United States    Chicago        NaT   Penelope
4     0.00  United States    Phoenix        NaT     Austin
5     0.00          China  Chongqing        NaT     Joshua
6     0.10  United States    Phoenix        NaT       Ruby
7     0.00  United States      Miami 2021-05-20       Luke
8     0.06  United States     Austin        NaT     Easton
9     0.00  United States    Chicago        NaT   Madeline

In [32]:
data = pd.read_excel(
    r"C:\Users\sayud\OneDrive\Desktop\Data Science\Pandas\Datasets-main\practice_1.xlsx"
)
print(data)

  First name  Last Name  Salary EEID
0       ross  tribbiani   20000   E1
1     rachel       bing   40000   E2
2     monica      green   25000   E7
3       joey     geller   60000   E8
4   chandler     buffay   33000   E4
5     phoebe       bing   45000   E5

In [33]:
# Create a new column "Full Name" by combining the capitalized first name and the last name
data["Full Name"] = data["First name"].str.capitalize() + "" + data["Last Name"]

print(data)

  First name  Last Name  Salary EEID       Full Name
0       ross  tribbiani   20000   E1   Rosstribbiani
1     rachel       bing   40000   E2      Rachelbing
2     monica      green   25000   E7     Monicagreen
3       joey     geller   60000   E8      Joeygeller
4   chandler     buffay   33000   E4  Chandlerbuffay
5     phoebe       bing   45000   E5      Phoebebing

In [34]:
# Added bonus column
data["Bonus"] = (data["Salary"] / 100) * 20
print(data)

  First name  Last Name  Salary EEID       Full Name    Bonus
0       ross  tribbiani   20000   E1   Rosstribbiani   4000.0
1     rachel       bing   40000   E2      Rachelbing   8000.0
2     monica      green   25000   E7     Monicagreen   5000.0
3       joey     geller   60000   E8      Joeygeller  12000.0
4   chandler     buffay   33000   E4  Chandlerbuffay   6600.0
5     phoebe       bing   45000   E5      Phoebebing   9000.0

In [35]:
# Assigning a list of month names to the "Month" column of the DataFrame
data["Month"] = ["January", "February", "March", "April", "May", "June"]

# Print the updated DataFrame to verify the "Month" column
print(data)

  First name  Last Name  Salary EEID       Full Name    Bonus     Month
0       ross  tribbiani   20000   E1   Rosstribbiani   4000.0   January
1     rachel       bing   40000   E2      Rachelbing   8000.0  February
2     monica      green   25000   E7     Monicagreen   5000.0     March
3       joey     geller   60000   E8      Joeygeller  12000.0     April
4   chandler     buffay   33000   E4  Chandlerbuffay   6600.0       May
5     phoebe       bing   45000   E5      Phoebebing   9000.0      June

In [36]:
# Example data dictionary
data = {"Months": ["January", "February", "March", "April", "May", "June"]}

# Creating the DataFrame
df = pd.DataFrame(data)

# Check the DataFrame structure and column names
print("Columns in the DataFrame:", df.columns)

# Ensure the column names are correct
df.columns = df.columns.str.strip()  # Remove any extra spaces


# Function to extract the first three characters
def extract(value):
    return value[0:3]


# Applying the function to the "Months" column
if "Months" in df.columns:
    df["Shorts Month"] = df["Months"].map(extract)
else:
    print("Column 'Months' not found in DataFrame")

# Printing the final DataFrame
print(df)

Columns in the DataFrame: Index(['Months'], dtype='object')
     Months Shorts Month
0   January          Jan
1  February          Feb
2     March          Mar
3     April          Apr
4       May          May
5      June          Jun

15.Group By

In [37]:
data = pd.read_excel(
    r"C:\Users\sayud\OneDrive\Desktop\Data Science\Pandas\Datasets-main\ESD.xlsx"
)
print(data)

       EEID        Full Name                 Job Title  Department  \
0    E02387      Emily Davis                Sr. Manger          IT
1    E04105    Theodore Dinh       Technical Architect          IT
2    E02572     Luna Sanders                  Director     Finance
3    E02832  Penelope Jordan  Computer Systems Manager          IT
4    E01639        Austin Vo               Sr. Analyst     Finance
..      ...              ...                       ...         ...
995  E03094     Wesley Young               Sr. Analyst   Marketing
996  E01909     Lillian Khan                   Analyst     Finance
997  E04398      Oliver Yang                  Director   Marketing
998  E02521      Lily Nguyen               Sr. Analyst     Finance
999  E03545      Sofia Cheng            Vice President  Accounting

              Business Unit  Gender  Ethnicity  Age  Hire Date  Annual Salary  \
0    Research & Development  Female      Black   55 2016-04-08         141604
1             Manufacturing    Male      Asian   59 1997-11-29          99975
2       Speciality Products  Female  Caucasian   50 2006-10-26         163099
3             Manufacturing  Female  Caucasian   26 2019-09-27          84913
4             Manufacturing    Male      Asian   55 1995-11-20          95409
..                      ...     ...        ...  ...        ...            ...
995     Speciality Products    Male  Caucasian   33 2016-09-18          98427
996     Speciality Products  Female      Asian   44 2010-05-31          47387
997     Speciality Products    Male      Asian   31 2019-06-10         176710
998     Speciality Products  Female      Asian   33 2012-01-28          95960
999               Corporate  Female      Asian   63 2020-07-26         216195

     Bonus %        Country       City  Exit Date
0       0.15  United States    Seattle 2021-10-16
1       0.00          China  Chongqing        NaT
2       0.20  United States    Chicago        NaT
3       0.07  United States    Chicago        NaT
4       0.00  United States    Phoenix        NaT
..       ...            ...        ...        ...
995     0.00  United States   Columbus        NaT
996     0.00          China    Chengdu 2018-01-08
997     0.15  United States      Miami        NaT
998     0.00          China    Chengdu        NaT
999     0.31  United States      Miami        NaT

[1000 rows x 14 columns]

In [38]:
# Grouping the data by "Department"
# .groupby("Department") groups the rows by unique values in the "Department" column
# .agg({"Gender": "count"}) applies the aggregation function "count" on the "Gender" column
# This will count the number of rows in each group for the "Gender" column
gp = data.groupby("Department").agg({"Gender": "count"})
print(gp)

                 Gender
Department
Accounting           96
Engineering         158
Finance             120
Human Resources     125
IT                  241
Marketing           120
Sales               140

In [39]:
# Grouping the data by Job Title and apllying aggregate function on EEID
gp = data.groupby("Job Title").agg({"EEID": "count"})
print(gp)

                                EEID
Job Title
Account Representative            21
Analyst                           51
Analyst II                        53
Automation Engineer                7
Business Partner                  19
Cloud Infrastructure Architect    15
Computer Systems Manager          21
Controls Engineer                 15
Development Engineer              19
Director                         121
Engineering Manager               20
Enterprise Architect              18
Field Engineer                    21
HRIS Analyst                      16
IT Coordinator                    11
IT Systems Architect              12
Manager                           98
Network Administrator             10
Network Architect                 18
Network Engineer                   7
Operations Engineer               12
Quality Engineer                  20
Service Desk Analyst              10
Solutions Architect               15
Sr. Account Representative         9
Sr. Analyst                       70
Sr. Business Partner              17
Sr. Manger                       110
System Administrator             15
Systems Analyst                   15
Technical Architect               17
Test Engineer                     12
Vice President                   105

In [40]:
# Grouping the data by both "Department" and "Gender"
# .groupby(["Department", "Gender"]) groups the rows by unique combinations of "Department" and "Gender"
# .agg({"EEID": "count"}) counts the number of occurrences (rows) in the "EEID" column for each group
gp = data.groupby(["Department", "Gender"]).agg({"EEID": "count"})
print(gp)

                        EEID
Department      Gender
Accounting      Female    53
                Male      43
Engineering     Female    80
                Male      78
Finance         Female    69
                Male      51
Human Resources Female    64
                Male      61
IT              Female   119
                Male     122
Marketing       Female    57
                Male      63
Sales           Female    76
                Male      64

In [41]:
gp1 = data.groupby(["Country"]).agg({"Annual Salary": "max"})
print(gp1)

               Annual Salary
Country
Brazil                258426
China                 257194
United States         258498

In [42]:
gp1 = data.groupby(["Country", "Gender"]).agg({"Annual Salary": "max"})
print(gp1)

                      Annual Salary
Country       Gender
Brazil        Female         258426
              Male           249506
China         Female         249686
              Male           257194
United States Female         258498
              Male           258081

15.Merge,Concatenate and Joins

In [43]:
data1 = {
    "Emp Id": ["E01", "E02", "E03", "E04", "E05"],
    "Names": ["Ajay", "Raju", "Ramesh", "Sujay", "Priya"],
    "Age": [32, 34, 23, 54, 23],
}

data2 = {
    "Emp Id": ["E01", "E02", "E03", "E04", "E05"],
    "Salary": [45000, 30000, 35000, 45000, 320000],
}
df1=pd.DataFrame(data1)
df2=pd.DataFrame(data2)
print(df1)
print()
print(df2)

  Emp Id   Names  Age
0    E01    Ajay   32
1    E02    Raju   34
2    E03  Ramesh   23
3    E04   Sujay   54
4    E05   Priya   23

  Emp Id  Salary
0    E01   45000
1    E02   30000
2    E03   35000
3    E04   45000
4    E05  320000

In [44]:
#Merging to Data Normal Join
print(pd.merge(df1,df2,on="Emp Id"))

  Emp Id   Names  Age  Salary
0    E01    Ajay   32   45000
1    E02    Raju   34   30000
2    E03  Ramesh   23   35000
3    E04   Sujay   54   45000
4    E05   Priya   23  320000

In [45]:
data3 = {
    "Emp Id": ["E01", "E02", "E03", "E04", "E05"],
    "Names": ["Ajay", "Raju", "Ramesh", "Sujay", "Priya"],
    "Age": [32, 34, 23, 54, 23],
}

data4 = {
    "Emp Id": ["E01", "E07", "E03", "E06", "E08"],
    "Salary": [45000, 30000, 35000, 45000, 320000],
}
df3=pd.DataFrame(data3)
df4=pd.DataFrame(data4)
print(df3)
print()
print(df4)

  Emp Id   Names  Age
0    E01    Ajay   32
1    E02    Raju   34
2    E03  Ramesh   23
3    E04   Sujay   54
4    E05   Priya   23

  Emp Id  Salary
0    E01   45000
1    E07   30000
2    E03   35000
3    E06   45000
4    E08  320000

In [46]:
#Merging to Data Left Join
print(pd.merge(df3,df4,on="Emp Id",how="left"))

  Emp Id   Names  Age   Salary
0    E01    Ajay   32  45000.0
1    E02    Raju   34      NaN
2    E03  Ramesh   23  35000.0
3    E04   Sujay   54      NaN
4    E05   Priya   23      NaN

In [47]:
#Merging to Data Right Join
print(pd.merge(df3,df4,on="Emp Id",how="right"))

  Emp Id   Names   Age  Salary
0    E01    Ajay  32.0   45000
1    E07     NaN   NaN   30000
2    E03  Ramesh  23.0   35000
3    E06     NaN   NaN   45000
4    E08     NaN   NaN  320000

In [48]:
#Merging to Data Inner Join
print(pd.merge(df3,df4,on="Emp Id",how="inner"))

  Emp Id   Names  Age  Salary
0    E01    Ajay   32   45000
1    E03  Ramesh   23   35000

In [49]:
data2 = {
    "Emp Id": ["E01", "E02", "E03", "E04", "E05"],
    "Names": ["Ajay", "Raju", "Ramesh", "Sujay", "Priya"],
    "Age": [32, 34, 23, 54, 23],
}
data2 = {
    "Emp Id": ["E06", "E07", "E08", "E09", "E10"],
    "Names": ["Aditya", "Sanaskar", "Rohit", "Saish", "Payal"],
    "Age": [32, 34, 23, 54, 23],
}
df1=pd.DataFrame(data1)
df2=pd.DataFrame(data2)
print(df1)
print()
print(df2)

  Emp Id   Names  Age
0    E01    Ajay   32
1    E02    Raju   34
2    E03  Ramesh   23
3    E04   Sujay   54
4    E05   Priya   23

  Emp Id     Names  Age
0    E06    Aditya   32
1    E07  Sanaskar   34
2    E08     Rohit   23
3    E09     Saish   54
4    E10     Payal   23

In [50]:
#Concating two data
print(pd.concat([df1,df2]))

  Emp Id     Names  Age
0    E01      Ajay   32
1    E02      Raju   34
2    E03    Ramesh   23
3    E04     Sujay   54
4    E05     Priya   23
0    E06    Aditya   32
1    E07  Sanaskar   34
2    E08     Rohit   23
3    E09     Saish   54
4    E10     Payal   23

16.Compare Data Frames

In [51]:
dict={"Fruits":["Apple","Mango","Banana","Pineapple"],
      "Price":[100,1000,50,70],
      "Quantity":[5,12,5,3]
      }
df1=pd.DataFrame(dict)
print(df1)

      Fruits  Price  Quantity
0      Apple    100         5
1      Mango   1000        12
2     Banana     50         5
3  Pineapple     70         3

In [52]:
#Copying df1 data in df2
df2=df1.copy()
print(df2)

      Fruits  Price  Quantity
0      Apple    100         5
1      Mango   1000        12
2     Banana     50         5
3  Pineapple     70         3

In [53]:
#Updating price of index 0(i.e Apple)
df2.loc[0,"Price"]=120
df2.loc[1,"Price"]=1200
df2.loc[3,"Price"]=100
df2.loc[0,"Quantity"]=7
print(df2)

      Fruits  Price  Quantity
0      Apple    120         7
1      Mango   1200        12
2     Banana     50         5
3  Pineapple    100         3

In [54]:
print(df1.compare(df2))

    Price         Quantity
     self   other     self other
0   100.0   120.0      5.0   7.0
1  1000.0  1200.0      NaN   NaN
3    70.0   100.0      NaN   NaN

In [55]:
# Compare df1 and df2, aligning differences row-wise (align_axis=0 is the default)
# The `compare` method will:
# - Show only rows with differences between df1 and df2.
# - Include two columns for each differing value: 'self' (from df1) and 'other' (from df2).
# - Align the differences row-wise.
print(df1.compare(df2,align_axis=0))

          Price  Quantity
0 self    100.0       5.0
  other   120.0       7.0
1 self   1000.0       NaN
  other  1200.0       NaN
3 self     70.0       NaN
  other   100.0       NaN

In [56]:
# Use the `compare` method with `keep_shape=True`
# - This keeps the shape of the original DataFrame (same number of rows and columns).
# - Rows and columns with no differences will show NaN.
print(df1.compare(df2,keep_shape=True))
print()
# Use the `compare` method with `keep_equal=True`
# - This keeps values that are equal in both DataFrames, in addition to showing differences.
# - For equal values, the 'self' and 'other' columns will both display the common value.
print(df1.compare(df2,keep_equal=True))

  Fruits         Price         Quantity
    self other    self   other     self other
0    NaN   NaN   100.0   120.0      5.0   7.0
1    NaN   NaN  1000.0  1200.0      NaN   NaN
2    NaN   NaN     NaN     NaN      NaN   NaN
3    NaN   NaN    70.0   100.0      NaN   NaN

  Price       Quantity
   self other     self other
0   100   120        5     7
1  1000  1200       12    12
3    70   100        3     3

17.Pivoting Data Frames

In [57]:
dict={"keys":["k1","k2","k3","k4"],
      "Names":["John","Sam","Taylor","Dave"],
      "House":["red","yellow","black","orange"]
}
df=pd.DataFrame(dict)
print(df)

  keys   Names   House
0   k1    John     red
1   k2     Sam  yellow
2   k3  Taylor   black
3   k4    Dave  orange

In [63]:
# Pivot the DataFrame
# - index: 'keys' will become the row labels in the resulting pivot table
# - columns: 'Names' will become the column labels
# - values: 'House' will populate the cell values
df.pivot(index="keys", columns="Names", values="House")

Names    Dave John     Sam Taylor
keys
k1        NaN  red     NaN    NaN
k2        NaN  NaN  yellow    NaN
k3        NaN  NaN     NaN  black
k4     orange  NaN     NaN    NaN

In [66]:
# Pivot the DataFrame with a list in 'values'
# - index: 'keys' specifies the row labels in the pivot table
# - columns: 'Names' specifies the column labels in the pivot table
# - values: ['House'] allows selecting multiple columns for values (though we only have one here)
print(df.pivot(index="keys",columns="Names",values=["House"]))

        House
Names    Dave John     Sam Taylor
keys
k1        NaN  red     NaN    NaN
k2        NaN  NaN  yellow    NaN
k3        NaN  NaN     NaN  black
k4     orange  NaN     NaN    NaN

18.Melting Data Frames